import { IFontLibrary } from '../interface';

// 4年级 上学期 写字表
export const GRADE_4_UPPER_WRITING_LIST = '潮据堤阔盼滚顿逐渐堵犹崩震霎余淘牵鹅卵坑洼填庄稼俗跃葡萄稻熟豌按舒适暗恐僵硬枪耐探愉曾沟溢蚊弄科横竖绳系蝇证复研究达驾驶唤纪技改程超亿核奥益联质哲任善暮吟题侧峰庐缘降费须逊输虎操占嫩顺均叠隙茎柄萎瞧固宅临慎选择址良穴厅卧专即较睁翻斧劈缓浊丈撑竭累液奔茂滋曰溺返衔悲惨兽佩坚违抗环锁既狠著愤获嗅呆奈巢齿躯掩护幼搏庞量愣级链颤攀猴念辫呵摸甚跪捶绕顽脖脱概惹昏握摔凭掐班鼓殷俩练套裤逃亏挖撤堂砸锅否旋况败椅尤恨帅预溃品丑豪塞秦征词催醉杰亦雄项肃默晰振胸怀赞效凡顾训斥戎尝诸竞唯豹派娶媳妇淹逼浮旱徒扔饶骗灌溉'
// 4年级 下学期 写字表
export const GRADE_4_LOWER_WRITING_LIST = '杂稀蜻蜓蝶宿徐疏茅檐翁笼赖剥构饰蹲凤序投例率耸踏倘绘谐寄眠慰藉卜锐滩帐烁蝙蝠霸鹰怒吼脂拭餐划晌辣渗挣番埋刷测详笨钝鸽毫凌末描隧态吨颅膨肢翼辟纳拥箱臭蔬碳钢隐健康胞疾防灶需繁漫灭藤萝膝涛躲瓶挤叉挥桦涂茸绣潇穗朦胧寂霞抹忧虑贪职屏蹭稿腔解闷蛇遭殃盆勃讨厌坝忠毒绩孵警戒歪咕汤掘伏啼调促颇剧苟譬侍馆附脾敏捷昂供添扩范努刹烂替镶紫仅浙罗杜鹃窄郁肩臀移额陆乳笋端源囊萤恭勤博贫逢晋扭炕铅晃哩栓胳膊劫绸扒敌尸慌芙蓉洛壶雁营射弹荣爆炸伦腹剖窟窿混嘶维秩岗宰措遣践介绍妖矩乖撵烫丫拽福舔葵瘦棒罢硕允砌牌禁惩踪啸私颊拆'
// 4年级 上学期 识字表
export const GRADE_4_UPPER_LEARNING_LIST = '盐薄屹昂鼎沸贯浩崩震霎余恢鹅卵俗跃穗镀埂烁巢苇罗霸占昧坠怀豌僵预揭苔囚框溢蝙蝠即锐系铛蝇证障碍荧屏唤纪获赖潜亿索奥舶质哲避撼喧雀檐驻钞培赌媒氛账贺樟杠狡猾暮瑟缘降骚逊输均柄蜗曲萎宅隐毫慎址良掘搜倾骤置抛劈缓浊丈隆肢躯液少曰溺返斯惨盗驰恕押锁遭恶脏愤砸洪措混项熄浆塌窜颂绩圃卉蕾蕊玫茉莉牡丹棠嗅奈拯嘶哑庞级链攀相辫呵谓拳捶顽吁襟膊瓶怖凭欺掐囊露羡角殷盔撇啊霉亏哄拙唉钉况兵败恨帅彻溃誉丑豪韭芹蒜椒藕薯芋塞秦征将杰崛范魏晰效淮惑惩训斥难蓄迫租纠缠邀港扰拒签订宁要妄延昔茅炕旦媚戎诸竞唯豹娶媳巫绅旱徒吊磕凿溉拜侯肤扎剂髓纪标纲授揍键谱锈沫砖矿综氧俱'
// 4年级 下学期 识字表
export const GRADE_4_LOWER_LEARNING_LIST = '杂篱徐疏锄剥构冠序朴素率倘附捣绘谐慰藉卜绮和谈琥珀嗡脂拭渗俯扎番埋澎湃钝描隧衍吨颅膨捷辟崭乒乓拥菌臭蔬碳癌症率疾灶鹏揽驱践着党施懈宛碑宾吉咸兆廷予肿阶趾逻政浏漫涛挤叉绣潇绽朦胧晖徜徉炫垢怯曝赤携涉晕屈渊孟甫韩愈禹锡仲龚忧虑职屏蹭稿腔殃折疙瘩侮恶毒聋啄伏哼啼凄调看嚣吭吠促颇奢侈苟譬侍窥伺肝秆俏峭哺浦沦抡涣焕俊峻扩荷刹镶浙簇臀漆蜿蜒恭勤焉卒晋絮扭姥吧塞呜哇糠栓捆绑劫毙扒尸徽谜唇尚拌倔强嘱咐忍沮吭仪蹬妨搓葵祈遗憾污屑芙蓉洛单砚乾坤役屡摧雹晕膛弥脉葬剖裸泣汹维秩酣械岗宰遣泰杖敞拘蕴蔼慷慨贤戚惧彬躁焚妖矩乖撵丫拽冲瘦硕允砌覆啸缕搂颊矢殿抚鲸恰'

// 小学4年级 字库列表
export const GRADE_4_FONT_LIBRARY: IFontLibrary[] = [
    {
        name: '4年级 上学期 写字表',
        list: GRADE_4_UPPER_WRITING_LIST+GRADE_4_LOWER_WRITING_LIST+GRADE_4_UPPER_LEARNING_LIST+GRADE_4_LOWER_LEARNING_LIST,
        select: true
    },
    {
        name: '4年级 下学期 写字表',
        list: GRADE_4_LOWER_WRITING_LIST
    },
    {
        name: '4年级 上学期 识字表',
        list: GRADE_4_UPPER_LEARNING_LIST
    },
    {
        name: '4年级 下学期 识字表',
        list: GRADE_4_LOWER_LEARNING_LIST
    }
]

GRADE_4_FONT_LIBRARY.forEach(item => {
    console.log(item.name, item.list.length)
})

/**
 * 字库总列表
 */
export const FONT_LIBRARY = [
    ...GRADE_4_FONT_LIBRARY
]